## Plan Result (635: sandbox_enterprise - TerraformPlanApply)




<pre><code>Plan: 2 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.dts_sharedservices_sbox_reader
  * azurerm_role_assignment.dts_sharedservicesptl_sbox_reader




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.dts_sharedservices_sbox_reader will be created
  + resource "azurerm_role_assignment" "dts_sharedservices_sbox_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5356a0e7-324e-4efa-970b-4b4aec3f0ba3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab"
      + skip_service_principal_aad_check = (known after apply)
    }

  # azurerm_role_assignment.dts_sharedservicesptl_sbox_reader will be created
  + resource "azurerm_role_assignment" "dts_sharedservicesptl_sbox_reader" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5356a0e7-324e-4efa-970b-4b4aec3f0ba3"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/64b1c6d6-1481-44ad-b620-d8fe26a2c768"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

</details>





## :warning: Errors

* failed to add a label 635: sandbox_enterprise - TerraformPlanApply/add-or-update: label name is too long (max: 50)
<!-- github-comment: {"Command":"plan","PRNumber":154,"Program":"tfcmt","SHA1":"","Target":"635: sandbox_enterprise - TerraformPlanApply","Vars":{}} -->